import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import '../consts.dart';

class PrivacyPolicy extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: Padding(
          padding: EdgeInsets.only(left: defaultSidePadding, right: defaultSidePadding, bottom: defaultSidePadding),
          child: Scrollbar(
            child: SingleChildScrollView(
      child: Column(children: [
        const Text('''Политика конфиденциальности (для РСО)
Редакция от 24.03.2022

 


1. Общие условия
1.1. Настоящая Политика определяет порядок сбора, обработки и защиты компании ООО "Научно-техническое предприятие "РЭП" (далее ООО "Научно-техническое предприятие "РЭП") всей информации о физических лицах, юридических лицах и индивидуальных предпринимателей (далее Пользователе (-ях)), которая может быть получена ООО "Научно-техническое предприятие "РЭП" при оказании Пользователям услуг, предоставляемых ООО "Научно-техническое предприятие "РЭП", в том числе посредством использования сайта ООО "Научно-техническое предприятие "РЭП" в сети интернет по адресу: https://rep.dev.conres.ru/, его сервисов, и программ (далее - Сайт).

1.2. Целью настоящей Политики является обеспечение надлежащей защиты от несанкционированного доступа и разглашения персональной информации, которую Пользователь предоставляет о себе самостоятельно при использовании Сайта или в процессе регистрации, для приобретения услуг.

1.3. Отношения, связанные со сбором, хранением, распространением и защитой информации, предоставляемой Пользователем, регулируются настоящей Политикой, иными официальными документами ООО "Научно-техническое предприятие "РЭП" и действующим законодательством Российской Федерации.

1.4. Регистрируясь на Сайте и используя Сайт, Пользователь выражает свое полное и безоговорочное согласие с условиями настоящей Политики и указанными в ней условиями обработки его персональной информации, в том числе:

- при регистрации на Сайте – для персональных данных, которые Пользователь предоставляет ООО "Научно-техническое предприятие "РЭП" при заполнении формы для регистрации на Сайте. Пользователь считается давшим согласие на обработку своих персональных данных при проставлении галочки в поле «Я принимаю условия пользовательского соглашения и даю согласие на обработку моих персональных данных» в момент нажатия кнопки «Войти»;

- при внесении/изменении персональных данных в разделе «Информация» Личного кабинета – для персональных данных, которые Пользователь предоставляет при редактировании информации в Личном кабинете. Пользователь считается давшим согласие на обработку своих вновь внесенных или измененных персональных данных в момент нажатия кнопки «Добавить»;

- при заполнении формы обратной связи – для персональных данных, которые Пользователь предоставляет ООО "Научно-техническое предприятие "РЭП" при заполнении формы обратной связи. Пользователь считается давшим согласие на обработку своих персональных данных, внесенных в поля формы обратной связи, в момент нажатия кнопки «Отправить»;

- при заполнении формы для подачи заявлений – для персональных данных, которые Пользователь предоставляет ООО "Научно-техническое предприятие "РЭП" при заполнении формы для подачи заявлений. Пользователь считается давшим согласие на обработку своих персональных данных, внесенных в поля формы подачи заявления, в момент нажатия кнопки «Принять условия и продолжить».

1.5. В случае несогласия Пользователя с условиями настоящей Политики, Пользователь должен воздержаться от использования Сайта и/или каких-либо Сервисов, доступных при его использовании.

1.6. Настоящая Политика конфиденциальности применяется только к информации, размещенной на Сайте ООО "Научно-техническое предприятие "РЭП" по адресу: https://rep.dev.conres.ru/. ООО "Научно-техническое предприятие "РЭП" не контролирует и не несет ответственности за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте.

 

2. Цели сбора, обработки и хранения информации предоставляемой пользователями Сайта
2.1. ООО "Научно-техническое предприятие "РЭП" собирает и хранит только ту персональную информацию, которая необходима для предоставления сервисов и исполнения Соглашений и договоров с Пользователем, за исключением случаев, когда законодательством предусмотрено обязательное хранение персональной информации в течение определенного законом срока.

2.2. Обработка персональных данных Пользователя осуществляется в соответствии с законодательством Российской Федерации. ООО "Научно-техническое предприятие "РЭП" обрабатывает персональные данные Пользователя в целях:

- идентификации Пользователя, зарегистрированного на Сайте;

- исполнения ООО "Научно-техническое предприятие "РЭП" договорных и иных обязательств перед Пользователем;

- предоставления Пользователю услуг, доступа к Сайту;

- установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта, оказания услуг, обработку запросов и заявок от Пользователя;

- проверки, исследования и анализа таких данных, позволяющих поддерживать и улучшать сервисы и разделы Сайта, а также разрабатывать новые сервисы и разделы Сайта;

- создание учетной записи (личного кабинета), если Пользователь зарегистрировался на Сайте;

- проведение статистических и иных исследований на основе обезличенных данных.

 

3. Условия обработки персональной информации предоставленной Пользователем и ее передачи третьим лицам
3.1. ООО "Научно-техническое предприятие "РЭП" принимает все необходимые меры для защиты персональных данных Пользователя от неправомерного доступа, изменения, раскрытия или уничтожения.

3.2. Обработка персональных данных Пользователя производится ООО "Научно-техническое предприятие "РЭП" с использованием баз данных на территории Российской Федерации.

3.3. Персональные данные обрабатываются с использованием автоматизированных систем, за исключением случаев, когда неавтоматизированная обработка персональных данных необходима в связи с исполнением требований законодательства.

3.4. Обработка персональных данных Пользователя включает совершение ООО "Научно-техническое предприятие "РЭП" следующих действий: сбор, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение.

3.5. Сбор персональных данных Пользователя осуществляется:

- при регистрации Пользователя на Сайте;

- при заполнении Пользователем информации в Личном кабинете;

- при заполнении и отправке Пользователем заявок, сообщений, форм обратной связи на сервисах Сайта.

3.6. Хранение персональных данных Пользователей осуществляется на электронных носителях. Персональные данные хранятся до момента их удаления Пользователем в Личном кабинете, а в случае поступления от Пользователя отзыва согласия на обработку персональных данных или требования об уничтожении персональных данных – до момента их уничтожения.

3.7. При обработке персональных данных с целью исполнения обязательств по соглашениям и договорам с Пользователем (п. 2.2. Политики) ООО "Научно-техническое предприятие "РЭП" может извлекать персональные данные и хранить их на бумажных носителях. Хранение таких персональных данных осуществляется в течение срока, установленного законодательством Российской Федерации об образовании и архивном деле.

3.8. Уточнение персональных данных может осуществляться Пользователем самостоятельно в Личном кабинете.

3.9. «Контроль Ресурсов» вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:

- Пользователь выразил согласие на такие действия;

- передача необходима для использования Пользователем сервиса, для обеспечения функционирования Сайта либо для исполнения соглашения или договора с Пользователем;

- передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры.

3.10. ООО "Научно-техническое предприятие "РЭП" вправе использовать предоставленную Пользователем информацию, в том числе персональные данные, в целях обеспечения соблюдения требований действующего законодательства Российской Федерации (в том числе в целях предупреждения и/или пресечения незаконных и/или противоправных действий Пользователей). Раскрытие предоставленной Пользователем информации может быть произведено лишь в соответствии с действующим законодательством Российской Федерации по требованию суда, правоохранительных органов, а равно в иных предусмотренных законодательством Российской Федерации случаях.

3.11. Обработка персональных данных Пользователя осуществляется без ограничения срока любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств. Обработка персональных данных Пользователей осуществляется в соответствии с Федеральным законом от 27.07.2006 N 152-ФЗ «О персональных данных».

3.12. ООО "Научно-техническое предприятие "РЭП" не проверяет достоверность информации, предоставляемой Пользователем, и исходит из того, что:

- Пользователь является дееспособным лицом, а в случае недееспособности согласие на обработку персональных данных предоставляется законным представителем Пользователя, ознакомившимся и согласившимся с условиями Политики;

- в рамках добросовестности предоставляет достоверную и достаточную информацию;

- поддерживает предоставленные персональные данные в актуальном состоянии, заботится о своевременности внесения изменений в ранее предоставленную информацию при появлении такой необходимости, включая, но не ограничиваясь: изменение паспортных данных, номера телефона, адреса места проживания.

 

4. Условия пользования Сайтом, Сервисами
4.1. Пользователь при пользовании Сайтом, подтверждает, что:

- обладает всеми необходимыми правами, позволяющими ему осуществлять регистрацию и использовать Услуги сайта;

- указывает достоверную информацию о себе в объемах, необходимых для пользования Услугами Сайта, обязательные для заполнения поля для дальнейшего предоставления Услуг сайта помечены специальным образом, вся иная информация предоставляется Пользователем по его собственному усмотрению.

4.2. ООО "Научно-техническое предприятие "РЭП" не проверяет достоверность получаемой (собираемой) информации о Пользователях, за исключением случаев, когда такая проверка необходима в целях исполнения обязательств перед Пользователем.

 

5. В рамках настоящей Политики под «персональной информацией Пользователя» понимаются:
5.1. Персональная информация, данные, которые Пользователь предоставляет о себе самостоятельно, в том числе при регистрации (создании учетной записи в Личном кабинете) или в процессе использования Сайта, его сервисов, включая, но не ограничиваясь: имя, фамилия, отчество (при наличии), дата (число, месяц и год) рождения, адрес электронной почты, адрес регистрации, номер телефона, паспортные данные и/или идентификационный номер налогоплательщика (ИНН), и/или страховой номер индивидуального лицевого счета (СНИЛС), сведения, необходимые для расчета стоимости услуг электроснабжения (тип жилья, номер счетчика, количество комнат, количество прописанных лиц, площадь жилья).

5.2. Данные, которые автоматически передаются сервисам Сайта в процессе их использования с помощью установленного на устройстве Пользователя программного обеспечения, в том числе 1Р-адрес. Данный файлов cookie, информация о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к сервисам), технические характеристики оборудования и программного обеспечения, используемых Пользователем, дата и время доступа к сервисам, адреса запрашиваемых страниц и иная подобная информация.

5.3. Личный кабинет – раздел сайта, доступ Пользователя к которому осуществляется после регистрации Пользователя на сайте посредством введения уникального логина и пароля. Личный кабинет содержит персональные данные Пользователя.

 

6. Изменение Политики конфиденциальности. Применимое законодательство
6.1. ООО "Научно-техническое предприятие "РЭП" имеет право вносить изменения в настоящую Политику конфиденциальности. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее размещения, если иное не предусмотрено новой редакцией Политики.

Продолжение пользования Сайтом или его сервисами после публикации новой редакции Политики означает принятие Политики и ее условий Пользователем. В случае несогласия с условиями Политики в новой редакции, Пользователь должен незамедлительно прекратить использование Сайта и его сервисов.

Действующая редакция всегда находится па странице по адресу https://rep.dev.conres.ru/privacy_policy

6.2. К настоящей Политике и отношениям между Пользователем и ООО "Научно-техническое предприятие "РЭП", возникающим в связи с применением Политики конфиденциальности, подлежит применению право Российской Федерации.

 

7. Обратная связь. Вопросы и предложения
7.1. Все предложения или вопросы по поводу настоящей Политики следует сообщать в ООО "Научно-техническое предприятие "РЭП" по электронной почте lexa_g@mail.ru, по телефону 79027909056 или на сайте https://rep.dev.conres.ru/."),
    '''),
        Container(
          width: MediaQuery.of(context).size.width,
          height: 55,
          child: ElevatedButton(
              onPressed: () {
                Navigator.pop(context);
              },
              child: Text("Согласен", style: buttonTextStyle),
              style: ElevatedButton.styleFrom(backgroundColor: colorMain)),
        ),
        Container(
          margin: EdgeInsets.only(top: 10),
          width: MediaQuery.of(context).size.width,
          height: 55,
          child: ElevatedButton(
              onPressed: () {
                Navigator.pop(context);
              },
              child: Text("Не согласен", style: TextStyle(color: Colors.white, fontSize: 18)),
              style: ElevatedButton.styleFrom(backgroundColor: colorGray)),
        ),
      ]),
    ))
        )
        );
  }
}
